SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg21/ieee802154_efr32xg21_configurator_out.c
const uint32_t ieee802154_2p4_high_speed_2mbps_coherent_modemConfig[] = {
  0x03011FFCUL, (uint32_t) &phyInfo_1, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x0011B10CUL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x00004100UL, /* FRC.MAXLENGTH */
  0x00044030UL, 0x00000825UL, /* Write: FRC.WHITECTRL */
  /*    4034 */ 0x00000100UL, /* FRC.WHITEPOLY */
  /*    4038 */ 0x000000FFUL, /* FRC.WHITEINIT */
  /*    403C */ 0x00010301UL, /* FRC.FECCTRL */
  0x00014050UL, 0x0000000BUL, /* Write: FRC.TRAILTXDATACTRL */
  0x0002405CUL, 0x00000D0FUL, /* Write: FRC.CONVGENERATOR */
  /*    4060 */ 0x00000101UL, /* FRC.PUNCTCTRL */
  0x000140A8UL, 0x00000000UL, /* Write: FRC.AUTOCG */
  0x000440B4UL, 0x00004001UL, /* Write: FRC.FCD0 */
  /*    40B8 */ 0x00000CFFUL, /* FRC.FCD1 */
  /*    40BC */ 0x00004101UL, /* FRC.FCD2 */
  /*    40C0 */ 0x00000DFFUL, /* FRC.FCD3 */
  0x1001C01CUL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C01CUL, 0x000802F5UL, /* OR: AGC.CTRL0 */
  0x1001C020UL, 0x000000FFUL, /* AND: AGC.CTRL1 */
  0x3001C020UL, 0x00001300UL, /* OR: AGC.CTRL1 */
  0x0001C050UL, 0x0C304187UL, /* Write: AGC.GAINRANGE */
  0x01010008UL, 0x0000170EUL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0xFFFFFFFFUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0xEDB88320UL, /* Write: RFCRC.POLY */
  0x0108401CUL, 0x00000010UL, /* Write: MODEM.MIXCTRL */
  /*    4020 */ 0x04000000UL, /* MODEM.CTRL0 */
  /*    4024 */ 0x0001C01FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x00003000UL, /* MODEM.CTRL2 */
  /*    402C */ 0x000A1000UL, /* MODEM.CTRL3 */
  /*    4030 */ 0x03000000UL, /* MODEM.CTRL4 */
  /*    4034 */ 0x00000000UL, /* MODEM.CTRL5 */
  /*    4038 */ 0x00000000UL, /* MODEM.CTRL6 */
  0x01064058UL, 0x00FF0264UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000841UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000001UL, /* MODEM.CF */
  /*    4064 */ 0x00080012UL, /* MODEM.PRE */
  /*    4068 */ 0xAB784E7CUL, /* MODEM.SYNC0 */
  /*    406C */ 0x00000000UL, /* MODEM.SYNC1 */
  0x010C4080UL, 0x08AC0032UL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x002A03DFUL, /* MODEM.MODINDEX */
  /*    408C */ 0x00000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x11070201UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x5A4B3721UL, /* MODEM.SHAPING1 */
  /*    409C */ 0x54626967UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x05152940UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x20800000UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x33334443UL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x24A49223UL, /* MODEM.SHAPING6 */
  0x010540ECUL, 0x8B57A890UL, /* Write: MODEM.SRCCHF */
  /*    40F0 */ 0x00000000UL, /* MODEM.INTAFC */
  /*    40F4 */ 0x07830464UL, /* MODEM.DSATHD0 */
  /*    40F8 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    40FC */ 0x000A209CUL, /* MODEM.DSACTRL */
  0x01024124UL, 0x00000000UL, /* Write: MODEM.AUTOCG */
  /*    4128 */ 0x00000000UL, /* MODEM.CGCLKSTOP */
  0x010B413CUL, 0x00000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4140 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  /*    4154 */ 0x00000000UL, /* MODEM.LRFRC */
  /*    4158 */ 0x00000000UL, /* MODEM.COH0 */
  /*    415C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4160 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4164 */ 0x00000000UL, /* MODEM.COH3 */
  0x0101423CUL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0xFFFFFFFFUL,
};

const uint32_t ieee802154_2p4_high_speed_1mbps_fec_modemConfig[] = {
  0x03011FFCUL, (uint32_t) &phyInfo_1, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x0011B10CUL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x00004100UL, /* FRC.MAXLENGTH */
  0x00044030UL, 0x00000825UL, /* Write: FRC.WHITECTRL */
  /*    4034 */ 0x00000100UL, /* FRC.WHITEPOLY */
  /*    4038 */ 0x000000FFUL, /* FRC.WHITEINIT */
  /*    403C */ 0x00010714UL, /* FRC.FECCTRL */
  0x00014050UL, 0x0000000BUL, /* Write: FRC.TRAILTXDATACTRL */
  0x0002405CUL, 0x00000D0FUL, /* Write: FRC.CONVGENERATOR */
  /*    4060 */ 0x00000101UL, /* FRC.PUNCTCTRL */
  0x000140A8UL, 0x00000000UL, /* Write: FRC.AUTOCG */
  0x000440B4UL, 0x00004001UL, /* Write: FRC.FCD0 */
  /*    40B8 */ 0x00000CFFUL, /* FRC.FCD1 */
  /*    40BC */ 0x00004101UL, /* FRC.FCD2 */
  /*    40C0 */ 0x00000DFFUL, /* FRC.FCD3 */
  0x1001C01CUL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C01CUL, 0x000802F5UL, /* OR: AGC.CTRL0 */
  0x1001C020UL, 0x000000FFUL, /* AND: AGC.CTRL1 */
  0x3001C020UL, 0x00001300UL, /* OR: AGC.CTRL1 */
  0x0001C050UL, 0x0C304187UL, /* Write: AGC.GAINRANGE */
  0x01010008UL, 0x0000170EUL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0xFFFFFFFFUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0xEDB88320UL, /* Write: RFCRC.POLY */
  0x0108401CUL, 0x00000010UL, /* Write: MODEM.MIXCTRL */
  /*    4020 */ 0x04000000UL, /* MODEM.CTRL0 */
  /*    4024 */ 0x0001C01FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x00003000UL, /* MODEM.CTRL2 */
  /*    402C */ 0x000A1000UL, /* MODEM.CTRL3 */
  /*    4030 */ 0x03000000UL, /* MODEM.CTRL4 */
  /*    4034 */ 0x00000000UL, /* MODEM.CTRL5 */
  /*    4038 */ 0x00000000UL, /* MODEM.CTRL6 */
  0x01064058UL, 0x00FF0264UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000841UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000001UL, /* MODEM.CF */
  /*    4064 */ 0x00080012UL, /* MODEM.PRE */
  /*    4068 */ 0x5487B183UL, /* MODEM.SYNC0 */
  /*    406C */ 0x00000000UL, /* MODEM.SYNC1 */
  0x010C4080UL, 0x08AC0032UL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x002A03DFUL, /* MODEM.MODINDEX */
  /*    408C */ 0x00000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x11070201UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x5A4B3721UL, /* MODEM.SHAPING1 */
  /*    409C */ 0x54626967UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x05152940UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x20800000UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x33334443UL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x24A49223UL, /* MODEM.SHAPING6 */
  0x010540ECUL, 0x8B57A890UL, /* Write: MODEM.SRCCHF */
  /*    40F0 */ 0x00000000UL, /* MODEM.INTAFC */
  /*    40F4 */ 0x07830464UL, /* MODEM.DSATHD0 */
  /*    40F8 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    40FC */ 0x000A209CUL, /* MODEM.DSACTRL */
  0x01024124UL, 0x00000000UL, /* Write: MODEM.AUTOCG */
  /*    4128 */ 0x00000000UL, /* MODEM.CGCLKSTOP */
  0x010B413CUL, 0x00000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4140 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  /*    4154 */ 0x00000000UL, /* MODEM.LRFRC */
  /*    4158 */ 0x00000000UL, /* MODEM.COH0 */
  /*    415C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4160 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4164 */ 0x00000000UL, /* MODEM.COH3 */
  0x0101423CUL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0xFFFFFFFFUL,
};

const uint32_t ieee802154_2p4_antdiv_modemConfig[] = {
  0x03011FFCUL, (uint32_t) &phyInfo_2, /* Write: SEQ.PHYINFO */
  0x1001C01CUL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C01CUL, 0x000802F5UL, /* OR: AGC.CTRL0 */
  0x0001C050UL, 0x0C304187UL, /* Write: AGC.GAINRANGE */
  0x01064024UL, 0x0052C007UL, /* Write: MODEM.CTRL1 */
  /*    4028 */ 0x00000000UL, /* MODEM.CTRL2 */
  /*    402C */ 0x00000000UL, /* MODEM.CTRL3 */
  /*    4030 */ 0x03000000UL, /* MODEM.CTRL4 */
  /*    4034 */ 0x00000000UL, /* MODEM.CTRL5 */
  /*    4038 */ 0x00000000UL, /* MODEM.CTRL6 */
  0x01014058UL, 0x00FF0264UL, /* Write: MODEM.TXBR */
  0x01054080UL, 0x08A0014BUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x744AC39BUL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000003F0UL, /* MODEM.MODINDEX */
  /*    408C */ 0x00000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  0x010140E0UL, 0x00000033UL, /* Write: MODEM.DCCOMP */
  0x010440F0UL, 0x00000000UL, /* Write: MODEM.INTAFC */
  /*    40F4 */ 0x07830464UL, /* MODEM.DSATHD0 */
  /*    40F8 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    40FC */ 0x000A209CUL, /* MODEM.DSACTRL */
  0x01014128UL, 0x00001003UL, /* Write: MODEM.CGCLKSTOP */
  0x010B413CUL, 0x00000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4140 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  /*    4154 */ 0x00000001UL, /* MODEM.LRFRC */
  /*    4158 */ 0x00000000UL, /* MODEM.COH0 */
  /*    415C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4160 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4164 */ 0x00000000UL, /* MODEM.COH3 */
  0x0101423CUL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010280A0UL, 0x00037870UL, /* Write: SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x0000C0D5UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01CB4205UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x008D2205UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B0UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLRX */
  0xFFFFFFFFUL,
};

const uint32_t ieee802154_2p4_rx_channel_switching_modemConfig[] = {
  0x03011FFCUL, (uint32_t) &phyInfo_3, /* Write: SEQ.PHYINFO */
  0x1001C01CUL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C01CUL, 0x000802F5UL, /* OR: AGC.CTRL0 */
  0x0001C050UL, 0x0C304187UL, /* Write: AGC.GAINRANGE */
  0x01064024UL, 0x0042C007UL, /* Write: MODEM.CTRL1 */
  /*    4028 */ 0x00000000UL, /* MODEM.CTRL2 */
  /*    402C */ 0x00000000UL, /* MODEM.CTRL3 */
  /*    4030 */ 0x03000000UL, /* MODEM.CTRL4 */
  /*    4034 */ 0x00000000UL, /* MODEM.CTRL5 */
  /*    4038 */ 0x00003820UL, /* MODEM.CTRL6 */
  0x01014058UL, 0x00FF0264UL, /* Write: MODEM.TXBR */
  0x01054080UL, 0x08A0025CUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x744AC39BUL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000003F0UL, /* MODEM.MODINDEX */
  /*    408C */ 0x00000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  0x010140E0UL, 0x00000073UL, /* Write: MODEM.DCCOMP */
  0x010440F0UL, 0x00000111UL, /* Write: MODEM.INTAFC */
  /*    40F4 */ 0x07830464UL, /* MODEM.DSATHD0 */
  /*    40F8 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    40FC */ 0x000A209CUL, /* MODEM.DSACTRL */
  0x01014128UL, 0x00001003UL, /* Write: MODEM.CGCLKSTOP */
  0x010B413CUL, 0x00000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4140 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  /*    4154 */ 0x00000001UL, /* MODEM.LRFRC */
  /*    4158 */ 0x00000000UL, /* MODEM.COH0 */
  /*    415C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4160 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4164 */ 0x00000000UL, /* MODEM.COH3 */
  0x0101423CUL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010280A0UL, 0x0000C0D5UL, /* Write: SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x0000C0D5UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x008D2205UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x008D2205UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B0UL, 0x01000037UL, /* Write: SYNTH.DSMCTRLRX */
  0xFFFFFFFFUL,
};

