SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg21/ieee802154_efr32xg21_configurator_out.c
const uint32_t ieee802154_2p4_coherent_modemConfig[] = {
  0x03011FFCUL, (uint32_t) &phyInfo_4, /* Write: SEQ.PHYINFO */
  0x1001C01CUL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C01CUL, 0x00080214UL, /* OR: AGC.CTRL0 */
  0x0001C050UL, 0x04304187UL, /* Write: AGC.GAINRANGE */
  0x01064024UL, 0x00620007UL, /* Write: MODEM.CTRL1 */
  /*    4028 */ 0x00007038UL, /* MODEM.CTRL2 */
  /*    402C */ 0x00000000UL, /* MODEM.CTRL3 */
  /*    4030 */ 0x03000000UL, /* MODEM.CTRL4 */
  /*    4034 */ 0x0F016800UL, /* MODEM.CTRL5 */
  /*    4038 */ 0x4024B840UL, /* MODEM.CTRL6 */
  0x01014058UL, 0x006900FCUL, /* Write: MODEM.TXBR */
  0x01054080UL, 0x11E06323UL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x744AC39BUL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000003F0UL, /* MODEM.MODINDEX */
  /*    408C */ 0x00008003UL, /* MODEM.AFC */
  /*    4090 */ 0x00000ABEUL, /* MODEM.AFCADJLIM */
  0x010140E0UL, 0x00000033UL, /* Write: MODEM.DCCOMP */
  0x010440F0UL, 0x00000B59UL, /* Write: MODEM.INTAFC */
  /*    40F4 */ 0x07830464UL, /* MODEM.DSATHD0 */
  /*    40F8 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    40FC */ 0x000A2090UL, /* MODEM.DSACTRL */
  0x01014128UL, 0x00001E00UL, /* Write: MODEM.CGCLKSTOP */
  0x010B413CUL, 0x008C1400UL, /* Write: MODEM.LONGRANGE1 */
  /*    4140 */ 0x28211A14UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x423B342EUL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x55435049UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x0CBA9876UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00006928UL, /* MODEM.LONGRANGE6 */
  /*    4154 */ 0x00000001UL, /* MODEM.LRFRC */
  /*    4158 */ 0x64282107UL, /* MODEM.COH0 */
  /*    415C */ 0x001A1714UL, /* MODEM.COH1 */
  /*    4160 */ 0x69C80420UL, /* MODEM.COH2 */
  /*    4164 */ 0x093A20A1UL, /* MODEM.COH3 */
  0x0101423CUL, 0x00000029UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010280A0UL, 0x00037870UL, /* Write: SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x0000C0D5UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01CB4205UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x008D2205UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B0UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLRX */
  0xFFFFFFFFUL,
};

const RAIL_ChannelConfigEntry_t ieee802154_2p4_2mbps_channels[] = {
  {
    .phyConfigDeltaAdd = ieee802154_2p4_dual_sync_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 11,
    .channelNumberStart = 11,
    .channelNumberEnd = 26,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ieee802154_2p4_high_speed_2mbps_coherent_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 27,
    .channelNumberStart = 27,
    .channelNumberEnd = 42,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ieee802154_2p4_1mbps_fec_channels[] = {
  {
    .phyConfigDeltaAdd = ieee802154_2p4_dual_sync_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 11,
    .channelNumberStart = 11,
    .channelNumberEnd = 26,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ieee802154_2p4_high_speed_1mbps_fec_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 27,
    .channelNumberStart = 27,
    .channelNumberEnd = 42,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ieee802154_2p4_antdiv_channels[] = {
  {
    .phyConfigDeltaAdd = ieee802154_2p4_antdiv_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 11,
    .channelNumberStart = 11,
    .channelNumberEnd = 26,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ieee802154_2p4_rx_channel_switching_channels[] = {
  {
    .phyConfigDeltaAdd = ieee802154_2p4_rx_channel_switching_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 11,
    .channelNumberStart = 11,
    .channelNumberEnd = 26,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ieee802154_2p4_coherent_channels[] = {
  {
    .phyConfigDeltaAdd = ieee802154_2p4_coherent_modemConfig,
    .baseFrequency = 2405000000,
    .channelSpacing = 5000000,
    .physicalChannelOffset = 11,
    .channelNumberStart = 11,
    .channelNumberEnd = 26,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfig_t ieee802154_2p4_2mbps_channelConfig = {
  .phyConfigBase = ieee802154_2p4_2mbps_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_2p4_2mbps_channels,
  .length = 2U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

const RAIL_ChannelConfig_t ieee802154_2p4_1mbps_fec_channelConfig = {
  .phyConfigBase = ieee802154_2p4_2mbps_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_2p4_1mbps_fec_channels,
  .length = 2U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

const RAIL_ChannelConfig_t ieee802154_2p4_antdiv_channelConfig = {
  .phyConfigBase = ieee802154_2p4_antdiv_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_2p4_antdiv_channels,
  .length = 1U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

const RAIL_ChannelConfig_t ieee802154_2p4_rx_channel_switching_channelConfig = {
  .phyConfigBase = ieee802154_2p4_antdiv_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_2p4_rx_channel_switching_channels,
  .length = 1U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

const RAIL_ChannelConfig_t ieee802154_2p4_coherent_channelConfig = {
  .phyConfigBase = ieee802154_2p4_antdiv_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = ieee802154_2p4_coherent_channels,
  .length = 1U,
  .signature = 0UL,
  .xtalFrequencyHz = 38400000UL,
};

uint32_t ieee802154AccelerationBuffer[175];
